<?php

//
// 各種定数定義
// 使用方法
// phpファイル内 : config('const.xxxx.tttt')
// ブレードファイル内 : {{config('const.xxxx.tttt')}}
//

return [

    /**
     * copyright
     */
    'copyright' => '守山商工会議所',
    /**
     * ページネーションの設定
     */
    'paginate_num' => [
        'default' => 30,
        'front_top_company' => 6,
        'front_top_matching' => 6,
        'front_company' => 12,
        'front_matching' => 12,
    ],

    /**
     * バリデーション
     */
    'validation_max' => [
        'mail_max' => 100,
        'password_max' => 255,
        'name_max' => 50,
    ],

    /**
     * ステータス
     */
    'status' => [
        'invalid' => 0,
        'valid' => 1,
    ],
    /**
     * ステータス名
     */
    'status_name' => [
        1 => '有効',
        0 => '無効',
    ],
    /**
     * セレクトボックス未選択項目
     */
    'unselected' => '選択してください',
    /** 
     * ユーザー
     */
    'user' => [
        'type' => [
            'administrator' => 1,
            'member' => 2,
        ],
        'type_name' => [
            '1' => '管理者ユーザー',
            '2' => '企業ユーザー',
        ],
        'send_mail_flg_name' => [
            0 => '受信しない',
            1 => '受信する',
        ],
    ],
    //パスワード履歴レコード生成上限
    'password_histories'      => [
        'limit_records' => 4
    ],
    //パスワード更新間隔リミット(days)
    'password_update'         => [
        'limit_days' => 90
    ],
    //リマインダーURLの有効期限(hour)
    'reminder'                => [
        'expiration_hour' => '+24',
        'expiration_hour_mail' => '24'
    ],

    /**
     * 画像タイプ
     */
    'image_type' => [
        'company' => 1,
        'matching' => 2
    ],
    /**
     * 画像の登録枚数
     */
    'image_registration_num' => 4,

    /** 
     * 企業
     */
    'company' => [
        'default_mail_send_flg' => 0,
        /**
         * 業種名
         */
        'industry_name' => [
            1 => '工業',
        ],
    ],
    /** 
     * 案件
     */
    'matching' => [
        /**
         * ステータス
         */
        'status' => [
            'before' => 1,
            'accepting' => 2,
            'closed' => 3,
        ],
        /**
         * ステータス名
         */
        'status_name' => [
            1 => '受付前',
            2 => '受付中',
            3 => '受付終了',
        ],
        /**
         * ステータス名(フロント)
         */
        'front_status_name' => [
            2 => '受付中',
            3 => '受付終了',
        ],
    ],
    //都道府県
    'pref' => [
        '1'   => '北海道',
        '2'   => '青森県',
        '3'   => '岩手県',
        '4'   => '宮城県',
        '5'   => '秋田県',
        '6'   => '山形県',
        '7'   => '福島県',
        '8'   => '茨城県',
        '9'   => '栃木県',
        '10'  => '群馬県',
        '11'  => '埼玉県',
        '12'  => '千葉県',
        '13'  => '東京都',
        '14'  => '神奈川県',
        '15'  => '新潟県',
        '16'  => '富山県',
        '17'  => '石川県',
        '18'  => '福井県',
        '19'  => '山梨県',
        '20'  => '長野県',
        '21'  => '岐阜県',
        '22'  => '静岡県',
        '23'  => '愛知県',
        '24'  => '三重県',
        '25'  => '滋賀県',
        '26'  => '京都府',
        '27'  => '大阪府',
        '28'  => '兵庫県',
        '29'  => '奈良県',
        '30'  => '和歌山県',
        '31'  => '鳥取県',
        '32'  => '島根県',
        '33'  => '岡山県',
        '34'  => '広島県',
        '35'  => '山口県',
        '36'  => '徳島県',
        '37'  => '香川県',
        '38'  => '愛媛県',
        '39'  => '高知県',
        '40'  => '福岡県',
        '41'  => '佐賀県',
        '42'  => '長崎県',
        '43'  => '熊本県',
        '44'  => '大分県',
        '45'  => '宮崎県',
        '46'  => '鹿児島県',
        '47'  => '沖縄県',
    ],

];
